# Relatório de Análise - Imóveis da Seguradora XPTO

## Importando a base de dados

In [2]:
import pandas as pd

In [13]:
dados = pd.read_csv('aluguel.csv', sep=';')

In [15]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [21]:
type(dados)

pandas.core.frame.DataFrame

In [22]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

## Informações gerais sobre os dados

In [23]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [24]:
tipos_de_dados = pd.DataFrame(dados.dtypes)

In [29]:
tipos_de_dados.columns = ['tipo']

In [30]:
tipos_de_dados.head()

           tipo
Tipo     object
Bairro   object
Quartos   int64
Vagas     int64
Suites    int64

In [32]:
tipos_de_dados.columns.name = 'variaveis'

In [34]:
tipos_de_dados.head(1)

variaveis    tipo
Tipo       object

In [35]:
dados.shape

(32960, 9)

In [39]:
print('O banco de dados possui {} registro de imóveis com {} variáveis.'.format(dados.shape[0],dados.shape[1]))

O banco de dados possui 32960 registro de imóveis com 9 variáveis.